Dataset/Swarm/29-07-24/8/mediaMicroservices/2/swarm-mm-wrk-compose-c6525-25g-exp8-havail0-hori1-verti1-infi0-client1-t4-c512-d30-R2000-N2
Using argument nginx
using  args: threads=4 and connections=512 and duration=30 and requests=2000
Running 30s test @ http://10.10.1.4:8080/wrk2-api/user-timeline/read
  4 threads and 512 connections
  Thread calibration: mean lat.: 4.221ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.227ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.204ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 4.214ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.25ms  732.25us   6.97ms   79.93%
    Req/Sec   526.21    235.34     1.11k    69.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.11ms
 75.000%    4.54ms
 90.000%    5.07ms
 99.000%    6.97ms
 99.900%    9.37ms
 99.990%   11.96ms
 99.999%   19.81ms
100.000%   19.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.857     0.000000            1         1.00
       3.551     0.100000         4004         1.11
       3.717     0.200000         7969         1.25
       3.851     0.300000        11915         1.43
       3.981     0.400000        15920         1.67
       4.111     0.500000        19942         2.00
       4.179     0.550000        21844         2.22
       4.255     0.600000        23847         2.50
       4.335     0.650000        25829         2.86
       4.427     0.700000        27792         3.33
       4.539     0.750000        29777         4.00
       4.603     0.775000        30807         4.44
       4.663     0.800000        31750         5.00
       4.743     0.825000        32785         5.71
       4.831     0.850000        33745         6.67
       4.935     0.875000        34728         8.00
       5.003     0.887500        35236         8.89
       5.075     0.900000        35745        10.00
       5.151     0.912500        36231        11.43
       5.251     0.925000        36722        13.33
       5.371     0.937500        37222        16.00
       5.443     0.943750        37466        17.78
       5.531     0.950000        37705        20.00
       5.635     0.956250        37958        22.86
       5.755     0.962500        38197        26.67
       5.899     0.968750        38448        32.00
       5.979     0.971875        38572        35.56
       6.079     0.975000        38697        40.00
       6.187     0.978125        38817        45.71
       6.323     0.981250        38946        53.33
       6.471     0.984375        39066        64.00
       6.599     0.985938        39127        71.11
       6.735     0.987500        39190        80.00
       6.863     0.989062        39254        91.43
       7.043     0.990625        39313       106.67
       7.251     0.992188        39375       128.00
       7.343     0.992969        39406       142.22
       7.459     0.993750        39437       160.00
       7.587     0.994531        39468       182.86
       7.775     0.995313        39499       213.33
       7.963     0.996094        39530       256.00
       8.075     0.996484        39547       284.44
       8.135     0.996875        39561       320.00
       8.287     0.997266        39578       365.71
       8.455     0.997656        39593       426.67
       8.663     0.998047        39608       512.00
       8.751     0.998242        39616       568.89
       8.855     0.998437        39624       640.00
       8.975     0.998633        39631       731.43
       9.103     0.998828        39639       853.33
       9.383     0.999023        39647      1024.00
       9.591     0.999121        39651      1137.78
       9.711     0.999219        39654      1280.00
       9.887     0.999316        39658      1462.86
      10.071     0.999414        39662      1706.67
      10.295     0.999512        39666      2048.00
      10.415     0.999561        39668      2275.56
      10.463     0.999609        39670      2560.00
      10.527     0.999658        39672      2925.71
      10.623     0.999707        39674      3413.33
      10.791     0.999756        39676      4096.00
      10.807     0.999780        39677      4551.11
      10.999     0.999805        39678      5120.00
      11.135     0.999829        39679      5851.43
      11.295     0.999854        39680      6826.67
      11.959     0.999878        39681      8192.00
      11.959     0.999890        39681      9102.22
      12.247     0.999902        39682     10240.00
      12.247     0.999915        39682     11702.86
      12.823     0.999927        39683     13653.33
      12.823     0.999939        39683     16384.00
      12.823     0.999945        39683     18204.44
      14.159     0.999951        39684     20480.00
      14.159     0.999957        39684     23405.71
      14.159     0.999963        39684     27306.67
      14.159     0.999969        39684     32768.00
      14.159     0.999973        39684     36408.89
      19.807     0.999976        39685     40960.00
      19.807     1.000000        39685          inf
#[Mean    =        4.253, StdDeviation   =        0.732]
#[Max     =       19.792, Total count    =        39685]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59181 requests in 30.00s, 10.38MB read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:   1972.70
Transfer/sec:    354.47KB